/**
 * Студент Измайлов Александр БПИ172
 * 5.11.2020
 * Кривые Безье. Семинар 4
 * Разработано в Intellij IDEA
 * На компьютере:
 *      OS: Mac OS 10.15.17
 *      RAM: 16GB
 *      Processor: 2 GHz Quad-Core Intel Core i5
 *      Graphics: Intel Iris Plus Graphics 1536 MB
 *      Display: 13,3-inch (2560 x 1600)
 * Выполнены пункты:
 *      Управление мышью
 *      Выбор цвета
 *      Отмена
 *      Кривая Безье любого порядка
 *      Кривая Безье 3го порядка
 *      Состованя кривая Безье из элементарных кривых 3го порядка
 *      Состованя замкнутая кривая Безье из элементарных кривых 3го порядка
 *      Дополнительная кривая методом де Кастельжо
 */
package hse.se.cg.bresenham

fun main() {
    MainWindow()
}
